<template>
  <section>
    <div>
    <h1>안녕하세요, 이소희입니다.</h1>
      <p>Vue.js로 리팩토링을 통한 최적화와 원활한 협업으로 사용자 경험 개선을 해온 4년차 프론트엔드 개발자입니다.</p>
    </div>
    <div>
      <h2>경력요약</h2>
      <ul>
        <li>Vue.js중심의 SPA개발 및 유지보수 4년차</li>
        <li>기존 Vue.js를 Nuxt.js로 전환 업무</li>
        <li>기획자, 디자이너와 소통하며 원활한 협업 경험</li>
      </ul>
    </div>
    <div>
      <h2>경력사항</h2>
      <ul>
        <li>
          <h3>
            고스트코어 /
            <span> 프론트엔드 개발자 (2021.10 ~ )</span>
          </h3>
          <ul>
            <li>
            CJ ENM 온스타일 리뉴얼(진행중)<br />
            - 기존 모듈 리팩토링<br />
            - Nuxt.js로 이전 사업
            </li>
            <li>
              CJ ENM의 패션 커머스 앱 '셀렙샵' 유지보수<br />
              - 기능유지 및 운영 이슈 대응<br />
              - 단기 이벤트/기획전 페이지 생성 및 유지보수
            </li>
            <li>
              CJ ENM의 패션 커머스 앱 '셀렙샵' 구축(Web)<br />
              - 기획전 페이지 모듈 기능 구현
            </li>
            <li>
              더한섬닷컴  앱 구축<br />
              - Vue.js 기반 화면 구축(퍼블리싱)
            </li>
          </ul>
        </li>
        <li>
          <h3>
            상록에스 /
            <span> 웹퍼블리싱(2020.02 ~ 2021.10)</span>
          </h3>
          <ul>
            <li>크레존(창의인성교육넷) 유지보수 및 리뉴얼</li>
            <li>대한탁구협회 사이트 퍼블리싱</li>
            <li>KT&G 상상univ 집현전 공모전 사이트 퍼블리싱 </li>
          </ul>
        </li>
      </ul>
    </div>
  </section>
</template>
