<template>
  <section>
    <h2>주요 프로젝트</h2>
    <div>
      <h3>CJ ENM 온스타일 유지보수</h3>
      <ul>
        <li>기간 : 2025.05 ~ ing</li>
        <li>기술 : Vue.js, Nuxt.js, Typescript</li>
        <li>기존 모듈에 기능을 안정적으로 확장하며 리팩토링을 통해 중복 로직 제거 및 코드 품질 개선을 수행</li>
        <li>기간이 정해진 이벤트 신청 기능 개발 시, 회원 정보와 참가여부 API를 연동하여 사용자 등급에 따라 UI 및 신청 조건을 동적으로 제어</li>
      </ul>
    </div>
    <div>
      <h3>CJ ENM의 '셀렙샵' 유지보수</h3>
      <ul>
        <li>기간 : 2025.01 ~ 2025.05</li>
        <li>빠르게 변화하는 패션사업에 대응하여 단기 이벤트/기획전 페이지 생성 및 유지보수</li>
        <li>로딩 속도 개선을 위해 API 요청 및 컴포넌트 렌더링을 비동기 처리하여 사용자 체감 속도 향상</li>
        <li>이벤트 신청을 위한 회원정보</li>
      </ul>
    </div>
    <div>
      <h3>CJ ENM 셀렙샵 구축</h3>
      <ul>
        <li>기간 : 2024.01 ~ 2024.12</li>
        <li>모듈단위로 구성된 기획전 페이지 개발</li>
        <li>단일 페이지 내 다중 모듈 구조에서 각 모듈이 독립적으로 동작하도록 설계 및 개발.</li>
        <li>동일모듈 중복 삽입으로 데이터 충돌 이슈가 발생하여 인스턴스에 고유 식별자를 부여해 컴포넌트 재사용성, 모듈의 독립성 및 안정성 확보로 유지보수성 향상.</li>
      </ul>
    </div>
  </section>
</template>

<script setup>
</script>
